const fs = require('fs/promises');

const bezrab = `Белгородская область 35,0 30,8 29,2 5,2 2,5 2,3
Брянская область 20,1 18,6 14,8 10,0 8,3 5,9
Владимирская область 28,0 18,9 14,4 11,7 6,8 3,7
Воронежская область 45,6 41,7 39,3 17,1 20,6 16,2
Ивановская область 22,5 15,4 15,0 3,7 1,6 1,9
Калужская область 22,6 22,3 13,6 4,7 6,4 8,8
Костромская область 12,4 9,2 8,7 4,1 2,5 3,6
Курская область 22,3 16,2 13,1 5,7 3,2 3,0
Липецкая область 26,1 22,5 17,3 6,5 4,2 4,5
Московская область 154,1 142,0 124,0 59,8 35,1 31,0
Орловская область 16,3 13,6 11,5 7,7 3,9 5,2
Рязанская область 21,0 15,4 15,6 12,7 3,6 0,1
Смоленская область 23,8 16,1 13,7 8,6 6,7 5,3
Тамбовская область 20,2 16,7 15,3 12,2 6,3 4,2
Тверская область 25,2 23,8 20,1 17,4 15,5 13,8
Тульская область 31,3 29,5 21,8 2,4 0,6 1,6
Ярославская область 38,4 31,3 24,0 2,1 2,9 1,7
Республика Карелия 17,7 15,1 13,8 10,1 10,1 6,8
Республика Коми 26,9 24,7 16,9 11,9 11,0 10,4
Архангельская область 33,3 27,7 27,3 17,2 13,8 9,6
Ненецкий автономный округ 1,5 1,7 1,5 0,7 0,7 0,6
Архангельская область без автономного округа 31,7 26,0 25,8 16,5 13,1 9,0
Вологодская область 25,9 19,0 17,2 10,3 7,9 5,8
Калининградская область 27,1 17,0 16,9 13,3 8,8 8,0
Ленинградская область 39,7 38,2 31,1 13,8 9,8 5,6
Мурманская область 22,1 17,1 11,9 7,0 7,2 7,2
Новгородская область 12,2 8,9 6,8 4,8 5,5 3,8
Псковская область 14,7 11,9 9,1 10,1 7,5 5,7
Республика Адыгея 17,8 15,6 8,2 4,3 2,2 2,7
Республика Калмыкия 12,0 10,9 8,8 4,1 1,2 …
Республика Крым 54,2 46,8 34,4 3,4 4,7 1,7
Краснодарский край 145,8 101,7 58,1 40,2 35,2 22,9
Астраханская область 38,6 35,3 21,6 9,8 5,0 0,2
Волгоградская область 64,1 45,4 37,0 32,1 17,6 11,0
Ростовская область 86,8 76,7 68,7 40,6 32,6 23,7
Республика Дагестан 209,8 175,0 173,3 142,4 99,3 107,3
Республика Ингушетия 83,7 81,3 77,5 0,8 0,6 0,7
Кабардино-Балкарская Республика 54,9 46,8 40,4 3,1 0,6 0,3
Карачаево-Черкесская Республика 26,4 21,6 16,7 6,2 3,8 2,7
Республика Северная Осетия – Алания 42,7 38,9 33,5 26,3 11,7 2,2
Чеченская Республика 95,2 72,0 70,0 3,7 8,4 6,3
Ставропольский край 75,1 62,6 54,7 19,0 14,2 17,6
Республика Башкортостан 85,3 67,1 45,2 40,2 27,9 20,2
Республика Марий Эл 17,9 11,7 11,1 7,0 6,5 4,5
Республика Мордовия 17,7 15,5 10,7 4,4 4,9 3,4
Республика Татарстан 55,9 48,0 42,6 13,5 18,8 14,1
Удмуртская Республика 33,6 21,1 18,2 11,5 11,0 10,9
Чувашская Республика 28,3 18,9 14,3 8,6 13,1 10,6
Пермский край 56,3 41,4 33,3 15,3 14,1 10,9
Кировская область 29,0 22,2 18,5 0,9 1,4 1,0
Нижегородская область 72,3 69,3 33,1 17,8 14,0 6,9
Оренбургская область 43,2 31,3 24,0 17,0 13,0 9,2
Пензенская область 27,9 23,2 19,1 13,6 13,0 10,0
Самарская область 59,0 45,3 33,7 15,2 16,2 12,1
Саратовская область 53,9 41,8 33,0 13,2 4,7 1,9
Ульяновская область 26,0 25,5 17,2 9,5 6,2 6,5
Курганская область 26,6 22,1 16,6 10,9 9,2 5,8
Свердловская область 86,4 72,3 50,4 36,9 39,0 34,6
Тюменская область 63,0 52,8 44,8 16,8 14,4 20,2
Ханты-Мансийский автономный округ – Югра 24,4 18,8 16,8 3,4 2,2 4,0
Ямало-Ненецкий автономный округ 6,3 4,9 4,6 3,8 2,8 2,7
Тюменская область без автономных округов 32,3 29,1 23,5 9,5 9,4 13,6
Челябинская область 91,7 55,7 43,7 12,6 18,9 11,7
Республика Алтай 11,3 8,8 8,2 3,5 4,3 2,9
Республика Тыва 19,9 12,6 8,2 9,2 10,9 8,3
Республика Хакасия 16,3 8,5 5,7 9,3 10,6 8,6
Алтайский край 58,8 41,8 39,0 38,5 22,8 15,1
Красноярский край 51,4 38,0 28,5 27,0 30,9 20,9
Иркутская область 68,8 57,6 42,4 37,1 43,0 35,4
Кемеровская область 68,6 51,4 42,1 28,5 24,5 17,4
Новосибирская область 87,1 65,6 47,4 26,0 26,0 16,5
Омская область 64,1 51,2 34,1 15,9 9,6 8,6
Томская область 37,0 28,1 20,9 14,7 12,4 12,4
Республика Бурятия 41,2 31,4 24,6 17,0 19,9 17,6
Республика Саха (Якутия) 34,9 33,0 29,4 11,0 10,1 13,3
Забайкальский край 47,3 42,9 33,5 12,2 14,1 9,7
Камчатский край 5,8 4,9 3,5 3,0 2,5 2,5
Приморский край 40,8 32,5 25,3 23,6 20,1 20,8
Хабаровский край 21,5 18,1 14,9 11,5 7,0 8,6
Амурская область 20,4 16,5 9,9 9,9 8,8 7,1
Магаданская область 4,3 3,4 2,7 0,8 1,5 1,3
Сахалинская область 14,4 11,4 7,6 4,4 4,2 3,8
Еврейская автономная область 4,2 3,7 2,7 3,8 2,7 3,5
Чукотский автономный округ 0,8 0,6 0,5 0,1 0,0 0,1`

const zp = `Белгородская область 16 993 28 006 32 799 35 511 41 855 47 257 25
Брянская область 13 358 23 479 28 720 31 713 37 428 40 927 49
Владимирская область 12 956 22 593 25 649 28 148 34 667 38 649 62
Воронежская область 13 883 29 291 31 925 34 982 41 156 45 087 31
Ивановская область 11 124 22 783 27 558 30 235 36 509 41 108 48
Калужская область 15 477 26 787 30 943 33 174 39 423 44 564 32
Костромская область 13 315 22 550 27 408 30 567 37 285 43 668 35
Курская область 14 685 25 383 29 917 32 871 39 401 43 719 34
Липецкая область 15 936 26 864 31 932 34 509 41 177 45 458 30
Московская область 22 641 36 170 43 332 49 213 55 746 64 870 12
Орловская область 13 115 22 152 27 121 30 008 35 923 43 730 33
Рязанская область 13 886 23 578 27 044 30 142 36 431 39 905 53
Смоленская область 14 546 23 893 28 870 31 484 35 653 42 734 40
Тамбовская область 13 631 24 876 27 924 30 290 34 783 39 229 58
Тверская область 13 873 23 703 27 771 30 773 36 265 41 274 47
Тульская область 15 349 25 035 28 315 30 935 37 146 42 375 45
Ярославская область 14 491 26 799 29 978 33 697 40 667 46 684 27
Республика Карелия 16 046 27 118 36 504 39 929 46 019 53 068 20
Республика Коми 22 260 32 331 39 601 42 603 50 840 56 152 14
Ненецкий автономный округ 52 270 74 218 89 570 92 620 115 336 128 204 3
Архангельская область без автономного округа 30 816 37 728 41 307 49 347 55 952 15
Вологодская область 14 115 25 002 29 706 31 887 37 178 42 708 41
Калининградская область 16 040 25 476 29 536 31 934 38 327 43 543 36
Ленинградская область 14 798 25 008 31 884 35 199 40 790 45 989 28
Мурманская область 24 047 38 001 50 139 55 506 65 707 75 786 8
Новгородская область 15 599 25 712 26 606 29 517 34 201 38 903 61
Псковская область 12 798 21 762 27 069 30 127 35 031 39 898 54
Республика Адыгея 12 279 22 417 28 716 32 882 36 627 42 684 43
Республика Калмыкия 7 774 15 325 19 892 21 415 23 771 28 635 83
Республика Крым 15 641 22 698 25 937 29 817 32 875 79
Краснодарский край 16 892 30 970 36 547 42 228 48 684 54 627 16
Астраханская область 14 697 24 149 25 912 27 675 33 137 36 593 66
Волгоградская область 13 775 21 953 24 627 27 226 32 673 35 575 71
Ростовская область 14 647 25 730 31 270 34 743 41 377 46 840 26
Республика Дагестан 15 678 26 625 27 395 29 952 37 606 39 686 56
Республика Ингушетия 9 630 15 358 17 247 18 573 23 047 24 414 85
Кабардино-Балкарская Республика 11 290 18 670 21 276 24 991 34 759 38 948 59
Карачаево-Черкесская Республика 10 878 17 754 18 903 20 256 23 035 25 619 84
Республика Северная Осетия – Алания 13 193 21 816 24 035 25 980 30 774 35 276 72
Чеченская Республика 11 982 22 703 24 645 26 425 30 751 35 920 69
Ставропольский край 13 016 20 871 23 305 25 133 30 100 32 930 78
Республика Башкортостан 17 499 27 065 29 827 31 935 36 463 40 022 51
Республика Марий Эл 10 336 18 496 21 138 23 024 27 276 31 013 80
Республика Мордовия 11 294 17 494 20 394 22 607 27 439 30 647 81
Республика Татарстан 18 424 32 031 34 815 38 601 45 932 52 524 21
Удмуртская Республика 12 984 24 493 25 997 28 346 33 820 38 939 60
Чувашская Республика 11 066 18 244 21 384 23 926 28 702 34 129 76
Пермский край 19 834 31 754 30 550 33 139 39 767 45 639 29
Кировская область 13 331 22 194 25 804 28 519 35 178 38 277 64
Нижегородская область 16 477 30 139 34 140 37 929 45 573 50 601 22
Оренбургская область 13 557 23 301 25 530 27 454 32 972 36 756 65
Пензенская область 12 920 21 540 24 352 26 676 32 072 36 429 68
Самарская область 20 223 27 799 29 708 32 343 38 444 42 701 42
Саратовская область 12 147 19 887 23 515 25 517 30 290 33 348 77
Ульяновская область 13 132 22 805 24 813 27 112 31 670 35 783 70
Курганская область 13 499 20 635 22 654 24 710 29 838 34 812 75
Свердловская область 22 194 34 116 37 452 40 281 47 109 53 413 19
Тюменская область 28 757 41 810 50 206 53 105 62 161 69 341
Ханты-Мансийский автономный округ – Югра 32 385 46 088 54 264 56 644 66 517 72 634 9
Ямало-Ненецкий автономный округ 43 367 69 942 96 553 104 323 120 010 139 651 2
Тюменская область без автономных округов 27 068 30 971 32 956 39 047 43 350 38
Челябинская область 16 821 24 646 26 628 29 474 35 347 39 703 55
Республика Алтай 13 536 18 257 22 642 24 958 29 564 34 817 74
Республика Тыва 10 160 15 500 18 803 20 435 24 460 28 934 82
Республика Хакасия 12 806 19 053 23 659 25 849 31 056 34 999 73
Алтайский край 11 029 21 277 24 981 27 305 32 901 36 431 67
Красноярский край 18 262 27 026 32 801 36 004 43 183 50 380 23
Иркутская область 15 110 21 730 27 514 30 270 37 484 42 483 44
Кемеровская область 15 341 21 921 25 544 28 174 33 996 39 408 57
Новосибирская область 16 276 25 477 31 440 35 070 44 359 49 936 24
Омская область 15 199 25 433 27 729 30 407 36 919 40 804 50
Томская область 15 070 26 885 29 001 31 210 37 954 41 600 46
Республика Бурятия 14 271 23 902 26 333 28 446 35 163 38 412 63
Республика Саха (Якутия) 23 088 36 918 46 108 50 090 59 040 69 031 11
Забайкальский край 14 205 22 369 28 021 31 043 38 601 42 758 39
Камчатский край 27 010 43 985 58 674 64 791 77 505 87 054 7
Приморский край 17 298 31 224 37 728 41 293 49 942 54 494 17
Хабаровский край 22 479 35 550 41 931 44 310 52 656 58 092 13
Амурская область 14 323 28 371 35 862 40 067 49 798 54 055 18
Магаданская область 27 801 51 011 71 805 82 031 101 999 111 157 5
Сахалинская область 30 727 48 753 62 792 66 211 79 322 87 902 6
Еврейская автономная область 15 348 24 061 28 815 31 118 37 753 43 479 37
Чукотский автономный округ 38 147 64 459 92 980 104 178 138 161 156 988 1
`
// С ПРОБЕЛАМИ В ЧИСЛАХ
// const result = data.split('\n').reduce((res, line) => {
//     const parts = line.split(' ').map(v => v.trim());
//     const words = parts.filter(word => !/^\d+$/.test(word))
//     const numbers = parts.filter(word => /^\d+$/.test(word))

//     const kamal = numbers.reduce((res, v, i) => {
//         if (!i) return `${res}${v}`

//         return `${res}${i % 2 ? '' : ','}${v}`
//     }, '')

//     return {
//         regions: [...res.regions, words.join(' ')],
//         data: [...res.data, kamal]
//     }
// }, { regions: [], data: [] }) 


// console.log(`REGIONS:\n${result.regions.join('\n')}`);  
// console.log('\n\n\n\n')
// console.log(`DATA:\n${result.data.join('\n')}`)

// БЕЗ ПРОБЕЛОВ
const data = bezrab;

const result = data.split('\n').reduce((res, line) => {
    const parts = line.split(' ').map(v => v.trim());
    const words = parts.filter(word => !/^\d+(\,\d+)?$/.test(word))
    const numbers = parts.filter(word => /^\d+(\,\d+)?$/.test(word))

    return {
        regions: [...res.regions, words.join(' ')],
        data: [...res.data, numbers.join(' ')]
    }
}, { regions: [], data: [] }) 


console.log(`REGIONS:\n${result.regions.join('\n')}`);  
console.log('\n\n\n\n')
console.log(`DATA:\n${result.data.join('\n')}`)